snlkuharlocal/src/DataProcessors/СформироватьКартинкуКодаШКQR/СформироватьКартинкуКодаШКQR.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СформироватьКартинкуКодаШКQR</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/СформироватьКартинкуКодаШКQR/ObjectModule.bsl
Перем ММвВПикселе;	
Перем CodeGenerator;

	
Функция СформироватьКартинкуШК_DataMatrix(СтруктураДанныхКомпонентыПечати, Знач ШтрихКод, Знач ДопПараметры) Экспорт    

	CodeGenerator										=		СтруктураДанныхКомпонентыПечати.CodeGenerator;    
	ММвВПикселе											=		СтруктураДанныхКомпонентыПечати.ММвВПикселе;
	ПараметрыШтрихкода									=		СтруктураДанныхКомпонентыПечати.ПараметрыПечатиПоУмолчанию;
	
	//ПараметрыШтрихкода = ПараметрыГенерацииШКпоУмолчанию();
	ПараметрыШтрихкода.ТипВходныхДанных = 1; // Тип входных данных (0-Строка, 1-Base64).
	
	ПараметрыШтрихкода.ТипКода	= 24; //24(тип кода - GS1 databar extended stacked), [с версии 9.0.2.2],       
	// Кухарь А.Ю.  24.04.2025 начало     
	если ДопПараметры<>Неопределено тогда
		ЗаполнитьЗначенияСвойств(ПараметрыШтрихкода,ДопПараметры);
	КонецЕсли;
	// Кухарь А.Ю.  24.04.2025 конец
	
	
	
	ПараметрыШтрихкода.Штрихкод	= Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ШтрихКод));
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(CodeGenerator, ПараметрыШтрихкода);
	
	Если НЕ РезультатШтрихкод.Успешно Тогда
		Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции

Функция СформироватьКартинкуШК_EAN(СтруктураДанныхКомпонентыПечати,Знач ШтрихКод,ДопПараметры=Неопределено) экспорт    
	CodeGenerator										=		СтруктураДанныхКомпонентыПечати.CodeGenerator;    
	ММвВПикселе											=		СтруктураДанныхКомпонентыПечати.ММвВПикселе;
	ПараметрыШК											=		СтруктураДанныхКомпонентыПечати.ПараметрыПечатиПоУмолчанию;
	КорректировкаРазмераШрифта							=		0;	
	
	ПараметрыШК.ТипКода			= 2;
	
	К = 150/Мин(СтруктураДанныхКомпонентыПечати.ВысотаРисунка,СтруктураДанныхКомпонентыПечати.ШиринаРисунка);
	
	мВысота = Окр(К * СтруктураДанныхКомпонентыПечати.ВысотаРисунка / ММвВПикселе);
	мШирина = Окр(К * СтруктураДанныхКомпонентыПечати.ШиринаРисунка / ММвВПикселе);	
	//
	УголПоворота	= ?(мВысота>мШирина, 90, 0);
	
	ПараметрыШК.Высота			= мВысота;
	ПараметрыШК.Ширина			= мШирина;	
	
	ПараметрыШК.ОтображатьТекст = Истина;
	
	
	ПараметрыШК.УголПоворота	= УголПоворота;
	
	// Кухарь А.Ю. 25.03.2024 начало
	если ТипЗнч(ДопПараметры)=Тип("Структура")  тогда
		если  ДопПараметры.Свойство("ОтображатьТекст") тогда
			ПараметрыШК.ОтображатьТекст=ДопПараметры.ОтображатьТекст;
		КонецЕсли;	
		
		Если ДопПараметры.Свойство("АгрегацииВCode128") тогда
			Если ДопПараметры.АгрегацииВCode128 тогда
				ПараметрыШК.ТипКода			= 4;
				ПараметрыШК.Штрихкод		= СтрЗаменить(ШтрихКод,"(00)","");
				//ПараметрыШК.Текст			= Сред(ШтрихКод,3);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю. 25.03.2024 конец
	
	ПараметрыШК.РазмерШрифта	= Цел(12*К) + КорректировкаРазмераШрифта;	
	ПараметрыШК.Штрихкод		= ШтрихКод;	
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(CodeGenerator, ПараметрыШК);
	
	Если НЕ РезультатШтрихкод.Успешно Тогда
		Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции

Функция ПодготовитьИзображениеШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода)
	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПараметрыГенерацииШКпоУмолчанию() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции


Функция ПолучитьКомпонентуФормированияDataMatrixКода() Экспорт	
	СтруктураВозврата=новый Структура("CodeGenerator,ММвВПикселе,Успех,Ошибки,ПараметрыПечатиПоУмолчанию");
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации DataMatrix-кода.'");	
	CodeGenerator = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	Если CodeGenerator = Неопределено Тогда 
		СтруктураВозврата.Ошибки 						= ТекстОшибки;   
		СтруктураВозврата.Успех							= Ложь;
	иначе
		СтруктураВозврата.CodeGenerator 				= CodeGenerator;    
		СтруктураВозврата.ММвВПикселе					= ЗаполнитьММвВПикселе();
		СтруктураВозврата.Успех							= Истина;      
		СтруктураВозврата.ПараметрыПечатиПоУмолчанию	= ПараметрыГенерацииШКпоУмолчанию();
	КонецЕсли;
	
		
	
	Возврат СтруктураВозврата;	
КонецФункции

Функция ЗаполнитьММвВПикселе()

	Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	возврат Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
КонецФункции




Функция СформироватьДопПараметрыДляПечтиЛистаНабораПереукладки (Лист,ДопПараметры)	 
		РевизитыШапкиЛН = ПолучитьРеквизитыШапки(Лист,"ДокОснование","Документ"); 
		Накладная=РевизитыШапкиЛН.ДокОснование;
		РевизитыШапкиНакладной = ОбщегоНазначения_ПИ.ПолучитьРеквизитыШапки_ПИ (Накладная,"Контрагент","Документ");  
		
		

		ДопПараметры.Вставить("ОтображатьТекст",ложь);				  
		ПечататьCode128ДляАгрегаций = ПолучитьЗначРеквСпр(РевизитыШапкиНакладной.Контрагент,"ПечататьCode128ДляАгрегаций");

		АгрегацияВCode128 = Ложь;
		Если ПечататьCode128ДляАгрегаций <> Неопределено Тогда
			АгрегацияВCode128 = ПечататьCode128ДляАгрегаций;	
		КонецЕсли;
		
		Если АгрегацияВCode128 Тогда 
			ДопПараметры.Вставить("АгрегацииВCode128",АгрегацияВCode128);
		иначе
			ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",Истина); 
		КонецЕсли;

		возврат ДопПараметры;	
КонецФункции           
	
	
Функция СформироватьМассивШКДляПечатиВЛисте (Лист,ДопПараметры)	 
		РевизитыШапкиЛН = ПолучитьРеквизитыШапки(Лист,"ДокОснование,КодАгрегации","Документ"); 
		Накладная=РевизитыШапкиЛН.ДокОснование;
		РевизитыШапкиНакладной = ПолучитьРеквизитыШапки(Накладная,"Дата,Номер,ГруппыТоваров,Контрагент,Комментарий,КодАгрегации","Документ");  
		
		
		ДопПараметры = Новый Структура("Артикул", "");
		ДопПараметры.Вставить("ОтображатьТекст",ложь);				  
		ПечататьCode128ДляАгрегаций = ПолучитьЗначРеквСпр(РевизитыШапкиНакладной.Контрагент,"ПечататьCode128ДляАгрегаций");

		АгрегацияВCode128 = Ложь;
		Если ПечататьCode128ДляАгрегаций <> Неопределено Тогда
			АгрегацияВCode128 = ПечататьCode128ДляАгрегаций;	
		КонецЕсли;
		
		Если АгрегацияВCode128 Тогда 
			ДопПараметры.Вставить("АгрегацииВCode128",АгрегацияВCode128);
		иначе
			ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",Истина); 
		КонецЕсли;

		возврат ДопПараметры;	
КонецФункции
